<template>
  <section class="section py-16">
    <h2 class="text-3xl font-bold text-dark-blue mb-2 uppercase">{{ title }}</h2>
      <div class="w-32 h-1 bg-main mb-10"></div>

      <ul class="space-y-[25px]">
        <li v-for="item in items" class="flex items-start">
          <div class="w-2 h-2 bg-main mt-2 mr-5 flex-shrink-0"></div>
          <p class="m-0">{{ item }}</p>
        </li>
      </ul>
  </section>
</template>

<script>
export default {
  name: "Advantages",
  data() {
    return {
      title: "Преимущества магазина",
      items: [
        "Богатый ассортимент расходки для плазменной резки: наконечники и сопла горелок, электроды, защитные колпаки, завихрители, защитные экраны, трубки водяного охлаждения, аксессуары для замены и ухода за деталями.",

        "Сопла, защитные стекла и линзы для лазерных систем и установок. Вся необходимая оптика в наличии.",

        "Газовые горелки, мундштуки и сопла для газокислородной резки. Более 200 наименований.",

        "Электроды для контактной сварки, сварочные электроды для TIG/MIG сварки.",

        "Осуществляем поставку всего нашего оборудование в любую точку России со сроком от 2 дней. При первой партии предоставляем тестовые образцы совершенно бесплатно. По вашему запросу, поставляем оригинальные детали и европейские аналоги.",

        "Мы стремимся постоянно улучшать наш подход, чтобы помогать клиентам улучшать качество резки и сварки!",
      ],
    };
  },
};
</script>

<style scoped>
/* Дополнительные стили при необходимости */
</style>
