<template>
  <section class="section py-16">
    <div class="container">
      <h2 class="text-3xl font-bold text-dark-blue mb-2 uppercase">{{ title }}</h2>
      <div class="w-32 h-1 bg-main mb-10"></div>
      <p class="text-dark-blue mb-8 max-w-5xl">{{ subtitle }}</p>
      
      <ul class="space-y-[25px]">
        <li v-for="item in services" class="flex items-start">
          <div class="w-2 h-2 bg-main mt-2 mr-5 flex-shrink-0"></div>
          <p class="m-0">{{ item }}</p>
        </li>
      </ul>
    </div>
  </section>
</template>

<script>
export default {
  name: 'OurGoal',
  data() {
    return {
      title: 'Наша цель — обспечить полную сеть помощи',
      subtitle: 'Мы готовы полностью вести вас в процессе совершения сделки, а вы, в свою очередь, можете рассчитывать от нас полное выполнение наших обязанностей, предоставленных при первом обращении:',
      services: [
        'Бесплатные образцы расходных материалов: проверьте наши расходные материалы на вашей системе плазменной резки;',
        'Поставка полного набора расходных материалов для резки и сварки: резаки, кабели и др;',
        'Бесплатное вводное обучение оператора плазменной резки;',
        'Обеспечение бесплатных проверок ваших резаков;',
        'Ремонт поврежденных резаков;',
        'Обучение на основе наиболее часто используемых систем плазменной резки в нашей лаборатории.',
        'Дополнительные продукты для использования в металлообрабатывающей промышленности, включая лазерную резку, газовую и сварку;',
        'Контроль технического состояния режущих систем;',
        'Измерение проводимости теплоносителя.'
      ]
    }
  }
}
</script>

<style scoped>
.bg-main {
  background-color: #FF8304;
}
.text-dark-blue {
  color: #212B36;
}
</style> 